In [1]:
# chapter 7 Handling Dates and Times

In [3]:
# 7.1 Converting Strings to Dates

import numpy as np
import pandas as pd

# create strings
date_string = np.array(['03-04-2005 11:35 PM',
                      '23-05-2010 12:01 AM',
                      '04-09-2009 09:09 PM'])

# convert to date times
[pd.to_datetime(date , format='%d-%m-%Y %I:%M %p') for date in date_string]

[Timestamp('2005-04-03 23:35:00'),
 Timestamp('2010-05-23 00:01:00'),
 Timestamp('2009-09-04 21:09:00')]

In [4]:
# convert to datetime with erros
[pd.to_datetime(date, format='%d-%m-%Y %I:%M %p', errors = 'coerce') for date in date_string]

[Timestamp('2005-04-03 23:35:00'),
 Timestamp('2010-05-23 00:01:00'),
 Timestamp('2009-09-04 21:09:00')]

In [5]:
# 7.2 Handling Time Zones
import pandas as pd

# create datetime
# add time zone
pd.Timestamp('2017-05-01 06:00:00' , tz = 'Europe/London')

Timestamp('2017-05-01 06:00:00+0100', tz='Europe/London')

In [6]:
# create datetime
date = pd.Timestamp('2017-05-01 06:00:00')

# set tiemzone
date_in_london = date.tz_localize('Europe/London')

# show datetime
date_in_london

Timestamp('2017-05-01 06:00:00+0100', tz='Europe/London')

In [7]:
# change time zone
date_in_london.tz_convert('Africa/Abidjan')

Timestamp('2017-05-01 05:00:00+0000', tz='Africa/Abidjan')

In [8]:
# create three dates
dates = pd.Series(pd.date_range('2/2/2002' , periods = 3, freq='M'))

# set time zone
dates.dt.tz_localize('Africa/Abidjan')

/tmp/ipykernel_17897/1294935685.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dates = pd.Series(pd.date_range('2/2/2002' , periods = 3, freq='M'))

0   2002-02-28 00:00:00+00:00
1   2002-03-31 00:00:00+00:00
2   2002-04-30 00:00:00+00:00
dtype: datetime64[ns, Africa/Abidjan]

In [9]:
from pytz import all_timezones

all_timezones[0:5]

['Africa/Abidjan',
 'Africa/Accra',
 'Africa/Addis_Ababa',
 'Africa/Algiers',
 'Africa/Asmara']

In [16]:
# 7.3 Selecting Dates and Times

# create dataframe
dataframe = pd.DataFrame()

# create date times
dataframe['date'] = pd.date_range('1/1/2001', periods = 100000 , freq = 'H')

# select observation between two datetimes
dataframe[(dataframe['date'] > '2002-1-1 01:00:00' ) &
          (dataframe['date'] <= '2002-1-1 04:00:00')]

/tmp/ipykernel_17897/1890588395.py:7: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  dataframe['date'] = pd.date_range('1/1/2001', periods = 100000 , freq = 'H')

                    date
8762 2002-01-01 02:00:00
8763 2002-01-01 03:00:00
8764 2002-01-01 04:00:00

In [17]:
# set index
dataframe = dataframe.set_index(dataframe['date'])

# Select observations between two datetimes
dataframe.loc['2002-1-1 01:00:00':'2002-1-1 04:00:00']

                                   date
date
2002-01-01 01:00:00 2002-01-01 01:00:00
2002-01-01 02:00:00 2002-01-01 02:00:00
2002-01-01 03:00:00 2002-01-01 03:00:00
2002-01-01 04:00:00 2002-01-01 04:00:00

In [19]:
# 7.4 Breaking Up Date Data into Multiple Features

import pandas as pd

# create dataframe
dataframe = pd.DataFrame()

# create five dates
dataframe['date'] = pd.date_range('1/1/2001' , periods = 150 , freq ='W')

# create features for year, month, hour, and minute
dataframe['year'] = dataframe['date'].dt.year
dataframe['month'] = dataframe['date'].dt.month
dataframe['day'] = dataframe['date'].dt.day
dataframe['hour'] = dataframe['date'].dt.hour
dataframe['minute'] = dataframe['date'].dt.minute

dataframe.head(3)

        date  year  month  day  hour  minute
0 2001-01-07  2001      1    7     0       0
1 2001-01-14  2001      1   14     0       0
2 2001-01-21  2001      1   21     0       0

In [29]:
# 7.5 Calculating the Difference Between Dates

# create dataframe 
dataframe = pd.DataFrame()

# create two date time features
dataframe['Arrived'] = [pd.Timestamp('01-01-2017') , pd.Timestamp('01-04-2017')]
dataframe['Left'] = [pd.Timestamp('01-05-2017') , pd.Timestamp('01-06-2017')]

# Calculate duration between features
dataframe['Left'] - dataframe['Arrived']

0   4 days
1   2 days
dtype: timedelta64[ns]

In [26]:
# Calculate duration between features
# remove days in output
pd.Series(delta.days for delta in (dataframe['Left'] - dataframe['Arrived']))

0    0
1    2
dtype: int64

In [30]:
# 7.6 Encoding Days of the Week

# create dates
dates = pd.Series(pd.date_range("2/2/2002" , periods =3, freq='M'))

# show days of the week
dates.dt.day_name()

/tmp/ipykernel_17897/4134899120.py:4: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dates = pd.Series(pd.date_range("2/2/2002" , periods =3, freq='M'))

0    Thursday
1      Sunday
2     Tuesday
dtype: object

In [31]:
# show days name to be numerical
dates.dt.weekday

0    3
1    6
2    1
dtype: int32

In [33]:
# 7.7 Creating a Lagged Feature

dataframe = pd.DataFrame()

# crete data
dataframe['date'] = pd.date_range('1/1/2001', periods=5, freq ="D")
dataframe['stock_price'] = [1.1, 2.2, 3.3, 4.4, 5.5]

# lagged values by one row
dataframe['previous_days_stock_price'] = dataframe['stock_price'].shift(1)

dataframe

        date  stock_price  previous_days_stock_price
0 2001-01-01          1.1                        NaN
1 2001-01-02          2.2                        1.1
2 2001-01-03          3.3                        2.2
3 2001-01-04          4.4                        3.3
4 2001-01-05          5.5                        4.4

In [35]:
# 7.8 Using Rolling Time Windows

# create datetimes
time_index = pd.date_range('1/1/2010' , periods =5, freq='M')

# create dataframe, set index
dataframe = pd.DataFrame(index = time_index)

# create feature
dataframe['stock_price'] = [1,2,3,4,5]

# calculate rolling mean
dataframe.rolling(window=2).mean()

/tmp/ipykernel_17897/889403115.py:4: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  time_index = pd.date_range('1/1/2010' , periods =5, freq='M')

            stock_price
2010-01-31          NaN
2010-02-28          1.5
2010-03-31          2.5
2010-04-30          3.5
2010-05-31          4.5

In [36]:
# 7.9 Handling Missing Data in Time Series

# create date
time_index = pd.date_range('1/1/2010', periods=5, freq='M')

#create dataframe, set index
dataframe =pd.DataFrame(index=time_index)

# create a feature with a gap of missing value
dataframe['Sales'] = [1,2,np.nan , np.nan, 5]

#  interpolate missing values
dataframe.interpolate()

/tmp/ipykernel_17897/3505478986.py:4: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  time_index = pd.date_range('1/1/2010', periods=5, freq='M')

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    4.0
2010-05-31    5.0

In [38]:
# we can also fill non value with last known value
dataframe.ffill()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    2.0
2010-04-30    2.0
2010-05-31    5.0

In [40]:
# replace non value with the latest known value
dataframe.bfill()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    5.0
2010-04-30    5.0
2010-05-31    5.0

In [41]:
# if we believe the line between two points is nonlinear

# interpolate missing value
dataframe.interpolate(method='quadratic')

               Sales
2010-01-31  1.000000
2010-02-28  2.000000
2010-03-31  3.059808
2010-04-30  4.038069
2010-05-31  5.000000

In [44]:
# restrict the number of interpolate value
dataframe.interpolate(limit=1, limit_direction='forward')

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    NaN
2010-05-31    5.0